; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 495730 2 3 2 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	infrared0 - mode
	GroundStation4 - direction
	Star5 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Star6 - direction
	Star0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 infrared1)
))

)

; plan
1. (turn_to satellite0 phenomenon10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 5
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 5
3. (turn_to satellite1 star0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star0)
   goals met: 1 of 5
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
5. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
7. (turn_to satellite1 star9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star9)
   goals met: 0 of 5
8. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
9. (take_image satellite1 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 5
11. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 2 of 5
12. (take_image satellite0 phenomenon10 instrument0 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 5
13. (take_image satellite1 star7 instrument4 infrared1)
   added: (have_image star7 infrared1)
   goals met: 4 of 5
14. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 5
15. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 4 of 5
16. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 5
